Revit 2027 API
WorksharingSaveAsOptions.OpenWorksetsDefault Property
 The default set of user-worksets to open when opening the model in the UI. Default is AskUserToSpecify.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SimpleWorksetConfiguration OpenWorksetsDefault { get; set; }
Public Property OpenWorksetsDefault As SimpleWorksetConfiguration
	Get
	Set
public:
property SimpleWorksetConfiguration OpenWorksetsDefault {
	SimpleWorksetConfiguration get ();
	void set (SimpleWorksetConfiguration value);
}
member OpenWorksetsDefault : SimpleWorksetConfiguration with get, set
Property Value
SimpleWorksetConfiguration
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace